## Solutions for Intro to SQL

In [2]:
import pandas as pd
import sqlite3

# Load the dataset
df = pd.read_csv("https://raw.githubusercontent.com/schuckers/Charlotte_SCORE_Summer25/refs/heads/main/Modules/Intro%20to%20SQL%20with%20Rugby%20by%20Izaan%20Khudadad/results.csv")

# Create an in-memory SQLite database
conn = sqlite3.connect(":memory:")
df.to_sql('matches', conn, index=False, if_exists='replace')

2783

1. Write a SQL query to list the away_team and home_score where matches that were played in Scotland.

In [15]:
query = """
SELECT away_team, home_score
FROM matches
WHERE country = 'Scotland'
LIMIT 10;
"""
pd.read_sql_query(query, conn)

  away_team  home_score
0   England           1
1   England           0
2   England           0
3   England           1
4   England           1
5   Ireland           3
6   England           1
7   Ireland           1
8     Wales           3
9   England           0

2. What is the average total score (home + away) for matches in the World Cup?

In [4]:
query = """
SELECT AVG(home_score + away_score) AS avg_total_score
FROM matches
WHERE world_cup = 1;
"""
pd.read_sql_query(query, conn)

   avg_total_score
0        43.306122

3. List the date, home_team, away_team, and total_points for matches played in France. Limit to 15 matches.

In [14]:
query = """
SELECT date, home_team, away_team, home_score + away_score AS total_points
FROM matches
WHERE country = 'France'
LIMIT 15;
"""
pd.read_sql_query(query, conn)

          date home_team     away_team  total_points
0   1906-01-01    France   New Zealand            46
1   1906-03-22    France       England            43
2   1908-01-01    France       England            19
3   1909-02-23    France         Wales            52
4   1910-03-03    France       England            14
5   1910-03-28    France       Ireland            11
6   1911-01-02    France      Scotland            31
7   1911-02-28    France         Wales            15
8   1912-01-01    France       Ireland            17
9   1912-04-08    France       England            26
10  1913-01-01    France      Scotland            24
11  1913-01-11    France  South Africa            43
12  1913-02-27    France         Wales            19
13  1914-01-01    France       Ireland            14
14  1914-04-13    France       England            52

4. List all matches played on neutral sites (sample of 5)

In [6]:
query = """
SELECT date, home_team, away_team, home_score, away_score, country
FROM matches
WHERE neutral = 1
LIMIT 5;
"""
pd.read_sql_query(query, conn)

         date  home_team away_team  home_score  away_score      country
0  1887-03-12      Wales   Ireland           0           1      England
1  1987-05-23     France  Scotland          20          20  New Zealand
2  1987-05-25    Ireland     Wales           6          13  New Zealand
3  1987-05-28  Argentina     Italy          25          16  New Zealand
4  1987-06-08    England     Wales           3          16    Australia